fpistm/Arduino_Core_STM32F1/cores/arduino/libstm32f1/analog.c
  AdcHandle.Instance = g_analog_init_config[id].adcInstance;

  if(do_init == 1) {

    HAL_ADC_DeInit(&AdcHandle);

    AdcHandle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;           /* Right-alignment for converted data */
    AdcHandle.Init.ScanConvMode          = DISABLE;                       /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
    AdcHandle.Init.ContinuousConvMode    = DISABLE;                       /* Continuous mode disabled to have only 1 conversion at each conversion trig */
    AdcHandle.Init.DiscontinuousConvMode = DISABLE;                       /* Parameter discarded because sequencer is disabled */
    AdcHandle.Init.ExternalTrigConv      = ADC_SOFTWARE_START;            /* Software start to trig the 1st conversion manually, without external event */

    g_current_init_id = id;
    if (HAL_ADC_Init(&AdcHandle) != HAL_OK) {
      return 0;
    }
  }

  /*##-2- Configure ADC regular channel ######################################*/
  if (HAL_ADC_ConfigChannel(&AdcHandle, &g_analog_init_config[id].adcChannelConf) != HAL_OK)
  {
    /* Channel Configuration Error */
    return 0;
  }

  /*##-3- Calibrate ADC then Start the conversion process ####################*/
  if (HAL_ADCEx_Calibration_Start(&AdcHandle) !=  HAL_OK)
  {
    /* ADC Calibration Error */
    return 0;
  }

  if (HAL_ADC_Start(&AdcHandle) != HAL_OK)
  {
    /* Start Conversation Error */
    return 0;
  }

  /*##-4- Wait for the end of conversion #####################################*/
  /*  For simplicity reasons, this example is just waiting till the end of the
      conversion, but application may perform other tasks while conversion
      operation is ongoing. */
  if (HAL_ADC_PollForConversion(&AdcHandle, 10) != HAL_OK)
  {
    /* End Of Conversion flag not set on time */
    return 0;
  }

  /* Check if the continous conversion of regular channel is finished */
  if ((HAL_ADC_GetState(&AdcHandle) & HAL_ADC_STATE_REG_EOC) == HAL_ADC_STATE_REG_EOC)
  {
    /*##-5- Get the converted value of regular channel  ########################*/
    uhADCxConvertedValue = HAL_ADC_GetValue(&AdcHandle);
  }

  if (HAL_ADC_Stop(&AdcHandle) != HAL_OK)
  {
    /* Start Conversation Error */
    return 0;
  }

  return uhADCxConvertedValue;
}

////////////////////////// PWM INTERFACE FUNCTIONS /////////////////////////////


/**
  * @brief TIM MSP Initialization
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  * @param htim: TIM handle pointer
  * @retval None
  */
void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef *htim)
{
  GPIO_InitTypeDef   GPIO_InitStruct;
  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* TIMx Peripheral clock enable */
  timer_enable_clock(htim);

  /* Enable GPIO Channels Clock */
  /* Enable GPIO clock ****************************************/
  if(g_analog_init_config[g_current_init_id].port == GPIOA) {
    __GPIOA_CLK_ENABLE();
  } else if(g_analog_init_config[g_current_init_id].port == GPIOB){
    __GPIOB_CLK_ENABLE();
  } else if(g_analog_init_config[g_current_init_id].port == GPIOC){
    __GPIOC_CLK_ENABLE();
  }

  /* Common configuration for all channels */
  GPIO_InitStruct.Pin = g_analog_init_config[g_current_init_id].pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

  g_analog_init_config[g_current_init_id].alFunction();

  HAL_GPIO_Init(g_analog_init_config[g_current_init_id].port, &GPIO_InitStruct);
}

/**
  * @brief  DeInitializes TIM PWM MSP.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PWM_MspDeInit(TIM_HandleTypeDef *htim)
{
  timer_disable_clock(htim);
}


/**
  * @brief  This function will set the PWM to the required value
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @param  clock_freq : frequency of the tim clock
  * @param  period : period of the tim counter
  * @param  value : the value to push on the PWM output
  * @param  do_init : if set to 1 the initialization of the PWM is done
  * @retval None
  */
void pwm_start(GPIO_TypeDef  *port, uint32_t pin, uint32_t clock_freq,
                uint32_t period, uint32_t value, uint8_t do_init)
{

  //find the instance in the global
  int8_t id = get_analog_instance(port, pin);
  if(id < 0) return;
  
  if (g_analog_timer_config[id]==NULL)
  {
	  g_analog_timer_config[id]=malloc(sizeof(TIM_HandleTypeDef));
  }
  /* Compute the prescaler value to have TIM counter clock equal to clock_freq Hz */
  g_analog_timer_config[id]->Instance               = g_analog_init_config[id].timInstance;
  g_analog_timer_config[id]->Init.Prescaler         = (uint32_t)(SystemCoreClock / clock_freq) - 1;
  g_analog_timer_config[id]->Init.Period            = period;
  g_analog_timer_config[id]->Init.ClockDivision     = 0;
  g_analog_timer_config[id]->Init.CounterMode       = TIM_COUNTERMODE_UP;
  g_analog_timer_config[id]->Init.RepetitionCounter = 0;

 // timHandle.State = HAL_TIM_STATE_RESET;
  //. (HAL_TIM_STATE_RESET = 0x00)
  
  if(do_init == 1) 
  {
    g_current_init_id = id;
    if (HAL_TIM_PWM_Init(g_analog_timer_config[id]) != HAL_OK) {
      return;
    }
  }

  HAL_TIM_PWM_Stop(g_analog_timer_config[id], g_analog_init_config[id].timChannel);

  
  /*##-2- Configure the PWM channels #########################################*/
  /* Common configuration for all channels */
  
	TIM_OC_InitTypeDef timConfig;
	
	timConfig.OCMode       = TIM_OCMODE_PWM1;
	timConfig.OCPolarity   = TIM_OCPOLARITY_HIGH;
	timConfig.OCFastMode   = TIM_OCFAST_DISABLE;
	timConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
	timConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET;
	timConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;
	timConfig.Pulse = value;
	 
	
	 
  if (HAL_TIM_PWM_ConfigChannel(g_analog_timer_config[id], &timConfig,
                                  g_analog_init_config[id].timChannel) != HAL_OK)
  {
    /*##-2- Configure the PWM channels #########################################*/
    return;
  }

  
  if(g_analog_init_config[id].useNchannel) {
    HAL_TIMEx_PWMN_Start(g_analog_timer_config[id], g_analog_init_config[id].timChannel);
  } else {
    HAL_TIM_PWM_Start(g_analog_timer_config[id], g_analog_init_config[id].timChannel);
  }

}

/**
  * @brief  This function will disable the PWM
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @retval None
  */
void pwm_stop(GPIO_TypeDef  *port, uint32_t pin)
{

  //find the instance in the global
  int8_t id = get_analog_instance(port, pin);
  if(id < 0) return;


  
  if(g_analog_init_config[id].useNchannel) {
    HAL_TIMEx_PWMN_Stop(g_analog_timer_config[id], g_analog_init_config[id].timChannel);
  } else {
    HAL_TIM_PWM_Stop(g_analog_timer_config[id], g_analog_init_config[id].timChannel);
  }

  HAL_TIM_PWM_DeInit(g_analog_timer_config[id]);
	 
}


/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
